Documents/ВозвратТовараСХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВозвратТовараСХранения</Name>
			<BasedOn>
				<xr:Item>Document.ПриемТовараНаХранение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ХранениеТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПриема</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПротэктора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьЗаМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ХранениеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументХранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВозвратТовараСХранения/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Склад = ДанныеЗаполнения.Склад;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДокументПриема = ДанныеЗаполнения;
	ДатаС = ДанныеЗаполнения.ДатаС;
	ДатаПо = ДанныеЗаполнения.ДатаПо;
	Для Каждого Стр из ДанныеЗаполнения.Товары Цикл
		Ст = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Ст,Стр);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ХранениеТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ХранениеТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ДокументХранения = ДокументПриема;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	
КонецПроцедуры

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура(); 
	//+БП: d.matyash (23.02.2025) <>
	//СтруктураМакетов.Вставить("АктПередачи", "Акт передачи");   
	//------------------------------ 
	СтруктураМакетов.Вставить("АктВозврата", "Акт повернення-передачі"); 
	//-БП: d.matyash (23.02.2025) <>
     
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()


Функция ПечатьАкта()

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговор";
	
	Макет = ПолучитьМакет("МакетАкт");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = ДокументПриема.Номер;
	ОбластьМакета.Параметры.ДатаВ = Формат(Дата,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.ДатаПр = Формат(ДокументПриема.Дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
	КонецЦикла;
	ОбластьМакета.Параметры.Адрес = Адрес;
	Паспорт = "";
	
	ТабДокумент.Вывести(ОбластьМакета);
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);
		//Областьмакета.Параметры.ДОТ = 
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Низ");
	Областьмакета.Параметры.Количество = Товары.Итог("Количество");
	Областьмакета.Параметры.ЗалоговаяСтоимость = Товары.Итог("ЗалоговаяСтоимость");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	ОбластьМакета.Параметры.Количество = Товары.Итог("Количество");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.Адрес = Адрес;
	ОбластьМакета.Параметры.Телефон = Телефон;
	Паспорт = "";
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()    

Функция ПечатьАктВозврат()
    //+БП: d.matyash (23.02.2025) <>   
	ТабДокумент = Новый ТабличныйДокумент;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВозвратТовараСХранения.Ссылка,
	                      |	ВозвратТовараСХранения.Номер,
	                      |	ВозвратТовараСХранения.Дата,
	                      |	ВозвратТовараСХранения.Контрагент,
	                      |	ВозвратТовараСХранения.ДатаС,
	                      |	ВозвратТовараСХранения.ДатаПо,
	                      |	ВозвратТовараСХранения.ДокументПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.Дата КАК ДатаПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.Номер КАК НомерПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.ОснованиеПервичное.Номер КАК НомерПриемаП,
	                      |	ВозвратТовараСХранения.ДокументПриема.ОснованиеПервичное.Дата КАК ДатаПриемаП,
	                      |	ВозвратТовараСХранения.Контрагент.ИНН КАК КонтрагентИНН,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ИНН КАК ОрганизацияИНН,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ОсновнойБанковскийСчет КАК ОрганизацияОсновнойБанковскийСчет,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация КАК Организация,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.НаименованиеПолное КАК ОрганизацияПолное,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	                      |	ВозвратТовараСХранения.Контрагент.КодПоЕДРПОУ
	                      |ИЗ
	                      |	Документ.ВозвратТовараСХранения КАК ВозвратТовараСХранения
	                      |ГДЕ
	                      |	ВозвратТовараСХранения.Ссылка = &Ссылка");   
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() тогда
		Сообщить("Не вдалося сформувати друковану форму!");
		Возврат ТабДокумент;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВозврат";
	
	Макет = ПолучитьМакет("АктВозврата");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакета.Параметры.Заполнить(Выборка);
	//ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(Выборка.НомерПриемаП),Выборка.НомерПриемаП,Выборка.НомерПриема);
	//ОбластьМакета.Параметры.Дата = Формат(?(ЗначениеЗаполнено(Выборка.ДатаПриемаП),Выборка.ДатаПриемаП,Выборка.ДатаПриема),"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Номер = Выборка.Номер;
	ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.КонтрагентКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.КонтрагентКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.КонтрагентКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.КонтрагентИНН = ?(ЗначениеЗаполнено(Выборка.КонтрагентИНН), "ІПН " + Выборка.КонтрагентИНН, "");    
	
	ОбластьМакета.Параметры.ОрганизацияКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.ОрганизацияКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.ОрганизацияКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.ОрганизацияИНН = ?(ЗначениеЗаполнено(Выборка.ОрганизацияИНН), "ІПН " + Выборка.ОрганизацияИНН, ""); 
	ОбластьМакета.Параметры.НомерСчета = ?(ЗначениеЗаполнено(Выборка.НомерСчета), "IBAN " + Выборка.НомерСчета, ""); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.КонтрагентАдрес = Адрес;
	ОбластьМакета.Параметры.КонтрагентНомер = Телефон;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Орг";
	ЗАпрос.УстановитьПараметр("Орг",Выборка.Организация);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.ОрганизацияАдрес = Адрес;
	ОбластьМакета.Параметры.ОрганизацияНомер = Телефон;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК Руководитель,
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК ДолжностьРуководитель,
	               |	ФИОФизЛицСрезПоследних.Фамилия,
	               |	ФИОФизЛицСрезПоследних.Имя,
	               |	ФИОФизЛицСрезПоследних.Отчество
	               |ИЗ
	               |	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	               |			&Дата,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	
	ЗАпрос.УстановитьПараметр("СтруктурнаяЕдиница",Выборка.Организация);
	ЗАпрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.УстановитьПараметр("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);

	Рез = ЗАпрос.Выполнить().Выбрать();
	ОрганизацияДиректор = "";
	Пока Рез.Следующий() Цикл
			ОрганизацияДиректор = Строка(Рез.ДолжностьРуководитель) + " " + Врег(Рез.Фамилия)  + " " + Строка(Рез.Имя)  + " " + Строка(Рез.Отчество);			
	КонецЦикла;

	ОбластьМакета.Параметры.ОрганизацияДиректор = ОрганизацияДиректор;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);
		
		Областьмакета.Параметры.СтоимостьЗаМесяц = Стр.Сумма / ?(СТр.Количество > 0, СТр.Количество, 1 ) / ?(СТр.КоличествоМесяцев > 0, СТр.КоличествоМесяцев, 1 );	

		//Областьмакета.Параметры.Период = Формат(Стр.ПериодС,"ДФ=dd.MM.yyyy") + " - " + Формат(Стр.ПериодПо,"ДФ=dd.MM.yyyy");	
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Областьмакета.Параметры.ИтогСумма = Товары.Итог("Сумма");	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.ОрганизацияПолное = СокрЛП(Выборка.ОрганизацияПолное);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()




// Процедура осуществляет печать документа. Можно направить печать на
// экран или принтер, а также распечатать необходмое количество копий.
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "АктПередачи" Тогда
		ТабДокумент = ПечатьАкта();          
	//+БП: d.matyash (23.02.2025) <>
	ИначеЕсли ИмяМакета = "АктВозврата" Тогда
		ТабДокумент = ПечатьАктВозврат();
	//-БП: d.matyash (23.02.2025) <>	
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Заказ = ДокументПриема.Сделка;
КонецПроцедуры
